import 'package:example/models/group.dart';
import 'package:flutter/material.dart';
import 'package:example/models/ProfilePerson.dart';

class Product {
  int id;
  String rating, price;
  List<Color> colors;
  String image, title, description;
  ProfilePerson seller;
  Product({
    required this.id,
    required this.price,
    required this.colors,
    required this.image,
    required this.title,
    required this.description,
    required this.seller,
    required this.rating,
  });
}

ProfilePerson demoSeller = ProfilePerson("name", "phone", "pass", "email","دیجی کالا", [],[],[]);
List<Product> mobileProducts = [
  Product(
    id: 1,
    price: "36416000",
    colors: [
      Color.fromARGB(255, 71, 192, 71),
      Color.fromARGB(255, 233, 128, 224),
      Color.fromARGB(255, 22, 25, 29)
    ],
    image: "assets/images/mobile3.jpg",
    title: "گوشی موبایل اپل مدل iPhone 13 A2634",
    description:
        "گوشی موبایل «iPhone 13» پرچم‌دار جدید شرکت اپل است که با چند ویژگی جدید و دوربین دوگانه روانه بازار شده است. اپل برای ویژگی‌ها و طراحی کلی این گوشی از همان فرمول چند سال اخیرش استفاده کرده است. نمایشگر آیفون 13 به پنل Super Retina مجهز ‌شده است تا تصاویر بسیار مطلوبی را به کاربر عرضه کند. این نمایشگر رزولوشن بسیار بالایی دارد؛ به‌طوری‌که در اندازه­‌ی 6.1 اینچی‌اش، حدود 460 پیکسل را در هر اینچ جا داده است. امکان شارژ بی‌‌سیم باتری در این گوشی وجود دارد. روکش سرامیکی صفحه‌نمایش این گوشی می‌تواند انقلابی در محافظت به‌پا کند. این گوشی ضدآب و ضد گردوخاک است. بدنه­ زیبا iPhone 13 در مقابل خط‌‌وخش مقاومت زیادی دارد؛ پس خیالتان از این بابت که آب و گردوغبار به‌‌راحتی روی آیفون 13 تأثیر نمی‌‌گذارد، راحت باشد.",
    seller: demoSeller,
    rating: "4.5",
  ),
  Product(
    id: 2,
    price: "10540000",
    colors: [
      Color.fromARGB(255, 237, 128, 228),
      Color.fromARGB(255, 94, 101, 199),
      Color.fromARGB(255, 43, 45, 48)
    ],
    image: "assets/images/mobile2.jpg",
    title: "گوشی موبایل سامسونگ مدل Galaxy A53 5G SM-A536E/DS ",
    description:
        ". در نمای رو‌به‌رویی این گوشی از صفحه‌نمایش با ابعاد 6.46 اینچ و رزولوشن 1080×2400 پیکسل از نوع سوپر امولد بهره برده است. صفحه‌نمایشی که با توجه به توانایی نمایش 407 پیکسل در هر اینچ و نرخ بروزرسانی 120 هرتز، کیفیت بسیار خوبی را ارائه می‌کند. در قسمت پشتی هم یک سنسور دوربین اصلی با رزولوشن 64 مگاپیکسل از نوع عریض در کنار سنسور 12 مگاپیکسل از نوع فوق عریض (ultrawide) و دو سنسور با رزولوشن 5 مگاپیکسل از نوع ماکرو (برای ثبت تصاویر از فاصله نزدیک) و سنجش عمق، سنسور‌های دوربین چهارگانه سامسونگ Galaxy A53 5G SM-A536E/DS را تشکیل می‌دهند. برای دوربین سلفی هم سنسور با رزولوشن 32 مگاپیکسل در نظر گرفته شده است.",
    seller: demoSeller,
    rating: "4.2",
  ),
  Product(
    id: 3,
    price: "57000000",
    colors: [
      Color.fromARGB(255, 148, 153, 224),
      Color.fromARGB(255, 203, 204, 221),
      Color.fromARGB(255, 86, 89, 94)
    ],
    image: "assets/images/mobile1.jpg",
    title: "گوشی موبایل اپل مدل iPhone 13 Pro Max A2644",
    description:
        "آیفون 13 پرو مکس به صفحه‌نمایشی 6.7 اینچی با رزولوشن 1284×2778 پیکسل مجهز شده است. برای اولین بار در تاریخ گوشی‌های هوشمند اپل، صفحه‌نمایش در نظر گرفته شده برای آیفون 13 پرو مکس توانایی ارائه نرخ بروزرسانی 120 هرتز را دارد که بدون شک می تواند صفحه‌نمایشی روان‌تر و به مراتب با‌کیفیت‌تری با نسبت نسل های قبلی ارائه می‌کند. این صفحه‌نمایش توانایی ارائه حداکثر روشنایی 1200 نیت (شمع در متر مربع) را دارد که همین امر سبب می شود تا در شرایط نوری متنوع و حتی زیر تابش مستقیم نور خورشید هم، وضوح تصویر بسیار خوبی دارد. در قسمت پشتی سه سنسور دوربین به همراه یک سنسور LIDAR با همان طراحی آیفون 12 پرو مکس قرار گرفته‌اند. یک سنسور دوربین اصلی با رزولوشن 12 مگاپیکسلی با گشودگی دریچه دیافراگم f/1.5، سنسور دوربین 12 مگاپیکسلی از نوع فوق عریض (Ultra Wide) و سنسور 12 مگاپیکسلی از نوع تله فوتو، دوربین سه‌گانه آیفون 13 پرو مکس را تشکیل می دهند. پردازنده A15 بایونیک هم این‌بار قدرتمند تر از همیشه متشکل از شش هسته (2 هسته قدرتمند‌تر و 4 هسته با صرفه انرژی کمتر) این پرچمدار قدرتمند را همراهی می‌کند. آیفون 13 پرو مکس در چهار مدل با حافظه‌‌های داخلی 128/256/512 گیگابایت در کنار مدل جدید با حافظه‌داخلی 1 ترابایت معرفی شد.",
    seller: demoSeller,
    rating: "4.6",
  ),
  Product(
    id: 4,
    price: "34500000",
    colors: [
      Color.fromARGB(255, 45, 57, 230),
      Color.fromARGB(255, 195, 198, 241),
      Color.fromARGB(255, 153, 7, 7)
    ],
    image: "assets/images/mobile4.jpg",
    title: "گوشی موبایل شیائومی مدل Mi 11 Ultra M2102K1C",
    description:
        "یکی از قدرتمند‌ترین گوشی‌های هوشمند این شرکت است که در جایگاه یک گوشی پرچمدار، توانایی ارائه عملکرد بسیار خوبی را دارد. این گوشی به صفحه‌نمایش با ابعاد 6.81 اینچ و رزولوشن 1440×3200 پیکسل از نوع AMOLED مجهز شده است. صفحه‌نمایش بسیار با‌کیفیت که توانایی نمایش 515 پیکسل در هر اینچ و نرخ بروزرسانی 120 هرتز را دارد. روشنایی 1700 نیت (شمع در متر مربع) هم از دیگر قابلیت‌های جذاب این صفحه‌نمایش است. در قسمت پشتی این گوشی شاهد قرار گیری سه سنسور دوربین هستیم که توانایی ارائه عملکرد فوق العاده‌ای را دارند.",
    seller: demoSeller,
    rating: "4.9",
  ),
];

List<Product> laptopProducts = [];
